# Height Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionRectangular..::..Height Property
StructuralSectionRectangular Class See Also
---
Section height, depth.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double Height { get; set; }
```

Visual Basic
---
```text
Public Property Height As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Height {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionRectangular Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace